# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

from random import randint

n = int(input("Введите длинну массива: "))
a = [randint(-10, 20) for _ in range(n)]

#a = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print(a)
id = []
mi = int(input("Введи минимум диапазона: "))
ma = int(input("Введи максимум диапазона: "))
m = 0
for i in range(len(a)):
    if (a[i] >= mi and a[i] <= ma):
        m += 1
        id.append(i)
print(f'Всего элементов в заданном диапазоне {m}. Индексы данных элементов {id}')
